#include <mcs51/8051.h>

#define LED P0_0	  //宏定义LED代表P0
/********************************************************
                    主程序
*********************************************************/

void delay_10us(unsigned int num) {
    while (num > 0) {
        num--;
    }
}

void main(void)
{
	LED = 0xff;       //P1口初始值，关闭led灯
	EA=1;          //全局中断开
	EX0=1;         //外部中断0开
	IT0=0;         //电平触发
	while(1)
	{
		//在此添加其他程序，中断程序可以跟此处的程序同步执行



	}
}
/****************************************************
                 外部中断程序
*****************************************************/
void Key_INT(void) __interrupt 0 //R0 R1 =  0/1   0/1
{
    delay_10us(1000);
    if (P3_2 == 0) {
    	LED = ~LED;
    }
}
